---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceInsertsWarning
source: html/35c1b8ef-f665-dfbd-2a52-86bbc7d8fe2b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceInsertsWarning Property

Can't place inserts outside of hosts. These elements won't be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantPlaceInsertsWarning { get; }
```